name: "tokenizer"
backend: "python"
max_batch_size: 32

input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [64]
  }
]

dynamic_batching {
  preferred_batch_size: [8, 16, 32]
  max_queue_delay_microseconds: 50000
}

instance_group [
  {
    count: 4
    kind: KIND_CPU
  }
]

response_cache {
  enable: true
}
