name: "ensemble_text_model"
platform: "ensemble"
max_batch_size: 32

input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "embeddings"
    data_type: TYPE_FP32
    dims: [1536]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "tokenizer"
      model_version: -1
      input_map {
        key: "text"
        value: "text"
      }
      output_map {
        key: "input_ids"
        value: "input_ids"
      }
    },
    {
      model_name: "siglip2_text_encoder_onnx"
      model_version: -1
      input_map {
        key: "input_ids"
        value: "input_ids"
      }
      output_map {
        key: "embeddings"
        value: "embeddings"
      }
    }
  ]
}
