name: "image_preprocessing"
backend: "python"
max_batch_size: 32

input [
  {
    name: "raw_image"
    data_type: TYPE_UINT8
    dims: [-1, -1, 3]
  }
]

output [
  {
    name: "pixel_values"
    data_type: TYPE_FP32
    dims: [3, 384, 384]
  }
]

dynamic_batching {
  preferred_batch_size: [4, 8, 16]
  max_queue_delay_microseconds: 50000
}

instance_group [
  {
    count: 4
    kind: KIND_CPU
  }
]
