name: "ensemble_image_model"
platform: "ensemble"
max_batch_size: 32

input [
  {
    name: "raw_image"
    data_type: TYPE_UINT8
    dims: [-1, -1, 3]
  }
]

output [
  {
    name: "image_embeds"
    data_type: TYPE_FP32
    dims: [1536]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "image_preprocessing"
      model_version: -1
      input_map {
        key: "raw_image"
        value: "raw_image"
      }
      output_map {
        key: "pixel_values"
        value: "pixel_values"
      }
    },
    {
      model_name: "siglip2_vision_encoder_onnx"
      model_version: -1
      input_map {
        key: "pixel_values"
        value: "pixel_values"
      }
      output_map {
        key: "image_embeds"
        value: "image_embeds"
      }
    }
  ]
}
